import random

last_names = (
    '赵钱孙李周吴郑王冯陈褚卫蒋沈韩杨'
    '朱秦尤许何吕施张孔曹严华金魏陶姜'
    '戚谢邹喻柏水窦章云苏潘葛奚范彭郎'
    '鲁韦昌马苗凤花方俞任袁柳酆鲍史唐'
    '费廉岑薛雷贺倪汤滕殷罗毕郝邬安常'
    '乐于时傅皮卞齐康伍余元卜顾孟平黄'
)

first_names = {
    'male': [
        '致远', '俊驰', '雨泽', '烨磊', '晟睿',
        '天佑', '文昊', '修洁', '黎昕', '远航',
        '旭尧', '鸿涛', '伟祺', '荣轩', '越泽',
        '浩宇', '瑾瑜', '皓轩', '浦泽', '绍辉',
        '绍祺', '升荣', '圣杰', '晟睿', '思聪'
    ],
    'female': [
        '沛玲', '欣妍', '佳琦', '雅芙', '雨婷',
        '韵寒', '莉姿', '雨婷', '宁馨', '妙菱',
        '心琪', '雯媛', '诗婧', '露洁', '静琪',
        '雅琳', '灵韵', '清菡', '溶月', '素菲',
        '雨嘉', '雅静', '梦洁', '梦璐', '惠茜'
    ]
}

colleges = ['计算机科学与工程学院', '化工与制药学院', '电气信息学院', '土木工程与建筑学院', '材料科学与工程学院', '管理学院', '法商学院', '化学与环境工程学院', '光电信息与能源工程学院',
            '数理学院', '外语学院.', '艺术设计学院', '继续教育学院', '国际学院', '马克思主义学院', '环境生态与生物工程学院']

majors = {'计算机科学与工程学院': ['智能科学与技术']}

persons = []

i = 0
while (i <= 3000):
    sex = random.choice(['female', 'male'])
    name = random.choice(last_names) + random.choice(first_names[sex])
    college = random.choice(colleges)
    persons.append({'sex': sex, 'name': name, 'college': college})
    i += 1

for item in persons:
    print(item)
